{"valid_strings": ["node.js", "express", "aws", "react", "redux", "devops", "ansible", "git", "objectivec", "javascript", "angularjs", "containers", "docker", "ci", "jenkins", "scrum", "java", "boot", "spring", "kafka", "nosql", "kubernetes", ".net", "asp.net", "css", "html", "tomcat", "angular", "agile", "unit", "rest", "jira", "automation", "hadoop", "big", "etl", "linux", "django", "python", "pattern", "php", "symfony", "mysql", "ddd", "cd", "entity", "sql", "sharepoint", "hibernate", "pl", "rails", "ruby", "android", "sdk", "rxjava", "kotlin", "patterns", "solid", "clean", "es", "tdd", "scripting", "shell", "unix", "rwd", "ee", "rabbitmq", "vuejs", "soap", "maven", "bootstrap", "doctrine", "redis", "manual", "webpack", "postgresql", "qa", "apis", "restful", "oracle", "svn", "c++", "laravel", "typescript", "nginx", "postgres", "ios", "mongo", "swift", "istqb", "selenium", "webdriver", "ccs", "cloud", "mongodb", "less", "sass", "jquery", "reactjs", "postresql", "computing", "distributed", "functional", "scala", "api", "mssql", "wcf", "visual", "teamcity", "azure", "continuous", "spa", "asp", "vue.js", "elastic", "search", "cqrs", "vue", "scss", "elasticsearch", "puppet", "webservices", "angular.js", "http", "protocol", "ui", "ux", "sap", "active", "directory", "jee", "jpa", "spark", "ai", "learning", "machine", "akka", "graphql", "jest", "itil", "excel", "security", "zend", "gitlab", "photoshop", "sketch", "uml", "boost", "stl", "gradle", "mvvm", "xcode", "cocoapods", "firebase", "vagrant", "chef", "apache", "tsql", "bi", "phpunit", "client", "responsive", "hive", "wordpress", "oop", "cucumber", "amazon", "soapui", "pm", "automated", "groovy", "spock", "winforms", "webapi", "wpf", "cocoa", "communication", "quality", "leadership", "unity", "gcp", "karma", "jasmine", "magento", "grunt", "gulp", "soa", "powershell", "protocols", "bash", "react.js", "go", "lang", "bamboo", "terraform", "cassandra", "solr", "junit", "jsf", "fastlane", "express.js", "mocha", "driven", "cordova", "enzyme", "golang", "perl", "npm", "flask", "algorithms", "script", "embedded", "ajax", "native", "ip", "mesos", "virtualization", "protractor", "jmeter", "rxjs", "relational", "tensorflow", "json", "microservices", "xml", "postman", "r", "celery", "rspec", "bdd", "node", "jboss", "confluence", "enterprise", "eclipse", "seo", "es+", "atlassian", "kanban", "german", "bitbucket", "project", "engine", "unreal", "jsp", "open", "source", "orm", "jvm", "material", "ionic", "tfs", "gwt", "office", "tcp", "alm", "bpmn", "debugging", "blockchain", "monitoring", "robot", "nodejs", "sense", "intellij", "codebases", "performance", "mockito"], "string_to_index": {"express": 74, "node": 148, "javascript": 104, "aws": 19, "react": 182, "redux": 185, "git": 81, "devops": 55, "ansible": 11, "angularjs": 10, "jenkins": 107, "spring": 221, "scrum": 201, "ci": 37, "java": 103, "boot": 29, "docker": 59, "kafka": 119, "containers": 47, "kubernetes": 123, "nosql": 150, "css": 51, "asp": 15, ".net": 146, "html": 94, "tomcat": 233, "agile": 1, "angular": 9, "rest": 188, "unit": 238, "jira": 109, "automation": 18, "linux": 129, "hadoop": 91, "big": 25, "etl": 72, "python": 177, "django": 58, "pattern": 158, "symfony": 226, "mysql": 144, "ddd": 53, "php": 163, "cd": 34, "sharepoint": 209, "entity": 69, "sql": 222, "hibernate": 92, "pl": 165, "rails": 181, "ruby": 192, "android": 8, "rxjava": 194, "solid": 215, "patterns": 159, "sdk": 203, "kotlin": 122, "clean": 38, "es": 71, "tdd": 228, "unix": 240, "shell": 210, "scripting": 200, "rwd": 193, "ee": 63, "rabbitmq": 180, "vuejs": 247, "soap": 213, "bootstrap": 30, "maven": 134, "redis": 184, "doctrine": 60, "webpack": 251, "postgresql": 168, "apis": 14, "restful": 189, "svn": 224, "oracle": 156, "laravel": 125, "typescript": 235, "postgres": 167, "ios": 98, "nginx": 147, "mongo": 139, "swift": 225, "objectivec": 152, "istqb": 100, "selenium": 206, "webdriver": 250, "ccs": 33, "cloud": 40, "mongodb": 140, "less": 128, "jquery": 112, "sass": 197, "reactjs": 183, "postresql": 170, "functional": 78, "distributed": 57, "computing": 45, "scala": 198, "api": 13, "mssql": 142, "wcf": 248, "visual": 245, "teamcity": 229, "continuous": 48, "azure": 20, "spa": 218, "vue": 246, "elastic": 64, "cqrs": 50, "search": 204, "scss": 202, "elasticsearch": 65, "puppet": 176, "webservices": 252, "http": 95, "protocol": 173, "ux": 242, "ui": 236, "active": 0, "sap": 196, "directory": 56, "jpa": 111, "jee": 106, "ai": 2, "spark": 219, "learning": 127, "machine": 130, "akka": 4, "graphql": 86, "jest": 108, "itil": 101, "excel": 73, "security": 205, "gitlab": 82, "zend": 258, "sketch": 211, "photoshop": 162, "boost": 28, "stl": 223, "uml": 237, "gradle": 85, "cocoapods": 42, "mvvm": 143, "xcode": 256, "firebase": 76, "chef": 36, "vagrant": 243, "apache": 12, "tsql": 234, "bi": 24, "phpunit": 164, "client": 39, "responsive": 187, "manual": 132, "hive": 93, "wordpress": 254, "oop": 154, "cucumber": 52, "amazon": 7, "soapui": 214, "pm": 166, "automated": 17, "groovy": 87, "spock": 220, "webapi": 249, "wpf": 255, "winforms": 253, "qa": 178, "quality": 179, "communication": 44, "cocoa": 41, "leadership": 126, "gcp": 79, "unity": 239, "jasmine": 102, "karma": 121, "magento": 131, "grunt": 88, "gulp": 89, "soa": 212, "powershell": 171, "protocols": 174, "bash": 22, "lang": 124, "go": 83, "bamboo": 21, "terraform": 231, "solr": 216, "cassandra": 32, "junit": 117, "jsf": 114, "fastlane": 75, "mocha": 137, "driven": 61, "cordova": 49, "enzyme": 70, "golang": 84, "perl": 161, "npm": 151, "flask": 77, "script": 199, "algorithms": 5, "ajax": 3, "native": 145, "mesos": 135, "virtualization": 244, "protractor": 175, "jmeter": 110, "rxjs": 195, "relational": 186, "tensorflow": 230, "json": 115, "microservices": 136, "xml": 257, "postman": 169, "celery": 35, "rspec": 191, "bdd": 23, "enterprise": 68, "jboss": 105, "confluence": 46, "eclipse": 62, "seo": 208, "atlassian": 16, "kanban": 120, "german": 80, "bitbucket": 26, "unreal": 241, "engine": 67, "ip": 99, "jsp": 116, "project": 172, "open": 155, "source": 217, "orm": 157, "jvm": 118, "material": 133, "ionic": 97, "tfs": 232, "gwt": 90, "embedded": 66, "office": 153, "tcp": 227, "alm": 6, "bpmn": 31, "debugging": 54, "blockchain": 27, "monitoring": 141, "robot": 190, "nodejs": 149, "sense": 207, "intellij": 96, "codebases": 43, "performance": 160, "mockito": 138}, "index_to_string": {"74": "express", "148": "node", "113": "javascript", "19": "aws", "182": "react", "185": "redux", "81": "git", "55": "devops", "11": "ansible", "10": "angularjs", "104": "javascript", "107": "jenkins", "221": "spring", "201": "scrum", "37": "ci", "103": "java", "29": "boot", "59": "docker", "119": "kafka", "47": "containers", "123": "kubernetes", "150": "nosql", "51": "css", "15": "asp", "146": ".net", "94": "html", "233": "tomcat", "1": "agile", "9": "angular", "188": "rest", "238": "unit", "109": "jira", "18": "automation", "129": "linux", "91": "hadoop", "25": "big", "72": "etl", "177": "python", "58": "django", "158": "pattern", "226": "symfony", "144": "mysql", "53": "ddd", "163": "php", "34": "cd", "209": "sharepoint", "69": "entity", "222": "sql", "92": "hibernate", "165": "pl", "181": "rails", "192": "ruby", "8": "android", "194": "rxjava", "215": "solid", "159": "patterns", "203": "sdk", "122": "kotlin", "38": "clean", "71": "es", "228": "tdd", "240": "unix", "210": "shell", "200": "scripting", "193": "rwd", "63": "ee", "180": "rabbitmq", "247": "vuejs", "213": "soap", "30": "bootstrap", "134": "maven", "184": "redis", "60": "doctrine", "251": "webpack", "168": "postgresql", "14": "apis", "189": "restful", "224": "svn", "156": "oracle", "125": "laravel", "235": "typescript", "167": "postgres", "98": "ios", "147": "nginx", "139": "mongo", "225": "swift", "152": "objectivec", "100": "istqb", "206": "selenium", "250": "webdriver", "33": "ccs", "40": "cloud", "140": "mongodb", "128": "less", "112": "jquery", "197": "sass", "183": "reactjs", "170": "postresql", "78": "functional", "57": "distributed", "45": "computing", "198": "scala", "13": "api", "142": "mssql", "248": "wcf", "245": "visual", "229": "teamcity", "48": "continuous", "20": "azure", "218": "spa", "246": "vue", "64": "elastic", "50": "cqrs", "204": "search", "202": "scss", "65": "elasticsearch", "176": "puppet", "252": "webservices", "95": "http", "173": "protocol", "242": "ux", "236": "ui", "0": "active", "196": "sap", "56": "directory", "111": "jpa", "106": "jee", "2": "ai", "219": "spark", "127": "learning", "130": "machine", "4": "akka", "86": "graphql", "108": "jest", "101": "itil", "73": "excel", "205": "security", "82": "gitlab", "258": "zend", "211": "sketch", "162": "photoshop", "28": "boost", "223": "stl", "237": "uml", "85": "gradle", "42": "cocoapods", "143": "mvvm", "256": "xcode", "76": "firebase", "36": "chef", "243": "vagrant", "12": "apache", "234": "tsql", "24": "bi", "164": "phpunit", "39": "client", "187": "responsive", "132": "manual", "93": "hive", "254": "wordpress", "154": "oop", "52": "cucumber", "7": "amazon", "214": "soapui", "166": "pm", "17": "automated", "87": "groovy", "220": "spock", "249": "webapi", "255": "wpf", "253": "winforms", "178": "qa", "179": "quality", "44": "communication", "41": "cocoa", "126": "leadership", "79": "gcp", "239": "unity", "102": "jasmine", "121": "karma", "131": "magento", "88": "grunt", "89": "gulp", "212": "soa", "171": "powershell", "174": "protocols", "22": "bash", "124": "lang", "83": "go", "21": "bamboo", "231": "terraform", "216": "solr", "32": "cassandra", "117": "junit", "114": "jsf", "75": "fastlane", "137": "mocha", "61": "driven", "49": "cordova", "70": "enzyme", "84": "golang", "161": "perl", "151": "npm", "77": "flask", "199": "script", "5": "algorithms", "3": "ajax", "145": "native", "135": "mesos", "244": "virtualization", "175": "protractor", "110": "jmeter", "195": "rxjs", "186": "relational", "230": "tensorflow", "115": "json", "136": "microservices", "257": "xml", "169": "postman", "35": "celery", "191": "rspec", "23": "bdd", "68": "enterprise", "105": "jboss", "46": "confluence", "62": "eclipse", "208": "seo", "16": "atlassian", "120": "kanban", "80": "german", "26": "bitbucket", "241": "unreal", "67": "engine", "99": "ip", "116": "jsp", "172": "project", "155": "open", "217": "source", "157": "orm", "118": "jvm", "133": "material", "97": "ionic", "232": "tfs", "90": "gwt", "66": "embedded", "153": "office", "227": "tcp", "6": "alm", "31": "bpmn", "54": "debugging", "27": "blockchain", "141": "monitoring", "190": "robot", "149": "nodejs", "207": "sense", "96": "intellij", "43": "codebases", "160": "performance", "138": "mockito"}, "string_to_skill": {"node.js": "Node.js", "express": "Node.js Express", "aws": "AWS", "react": "React.js", "redux": "Redux", "devops": "DevOps", "ansible": "Ansible", "git": "Git", "objectivec": "Objective-C", "javascript": "JavaScript", "angularjs": "Angular", "containers": "Docker/containers", "docker": "Docker/containers", "ci": "CI/CD", "jenkins": "Jenkins", "scrum": "Scrum", "java": "Java", "boot": "Spring Boot", "spring": "Spring", "kafka": "Kafka", "nosql": "NoSQL", "kubernetes": "Kubernetes", ".net": ".NET", "asp.net": "ASP .NET", "css": "CSS", "html": "HTML", "tomcat": "Tomcat", "angular": "Angular", "agile": "Agile", "unit": "Unit Testing", "rest": "REST API", "jira": "JIRA", "automation": "Automated Testing", "hadoop": "Hadoop", "big": "Big Data", "etl": "ETL", "linux": "Linux", "django": "Django", "python": "Python", "pattern": "Design Patterns", "php": "PHP", "symfony": "Symfony", "mysql": "MySQL", "ddd": "Domain Driven Development", "cd": "CI/CD", "entity": "Entity Framework", "sql": "SQL", "sharepoint": "Sharepoint", "hibernate": "Hibernate", "pl": "PL/SQL", "rails": "Ruby on Rails", "ruby": "Ruby on Rails", "android": "Android", "sdk": "Android SDK", "rxjava": "RxJava", "kotlin": "Kotlin", "patterns": "Design Patterns", "solid": "SOLID", "clean": "Clean Code", "es": "ECMAScript", "tdd": "Test Driven Development", "scripting": "Scripting", "shell": "Shell", "unix": "Unix", "rwd": "RWD", "ee": "Java EE", "rabbitmq": "RabbitMQ", "vuejs": "Vue", "soap": "SOAP", "maven": "Maven", "bootstrap": "Bootstrap", "doctrine": "Doctrine", "redis": "Redis", "manual": "Manual Testing", "webpack": "Webpack", "postgresql": "PostgreSQL", "qa": "Quality Assurance", "apis": "REST API", "restful": "REST API", "oracle": "Oracle DB", "svn": "SVN", "c++": "C++", "laravel": "Laravel", "typescript": "TypeScript", "nginx": "nginx", "postgres": "PostgreSQL", "ios": "iOS", "mongo": "MongoDB", "swift": "Swift", "istqb": "ISTQB", "selenium": "Selenium", "webdriver": "Selenium", "ccs": "CSS", "cloud": "Cloud", "mongodb": "MongoDB", "less": "LESS", "sass": "SASS", "jquery": "jQuery", "reactjs": "React.js", "postresql": "PostgreSQL", "computing": "Distributed systems", "distributed": "Distributed systems", "functional": "Functional programming", "scala": "Scala", "api": "REST API", "mssql": "MSSQL", "wcf": "WCF", "visual": "Visual Studio", "teamcity": "TeamCity", "azure": "Azure", "continuous": "CI/CD", "spa": "SPA", "asp": "ASP .NET", "vue.js": "Vue", "elastic": "Elasticsearch", "search": "Elasticsearch", "cqrs": "CQRS", "vue": "Vue", "scss": "SCSS", "elasticsearch": "Elasticsearch", "puppet": "Puppet", "webservices": "Webservices", "angular.js": "Angular", "http": "HTTP Protocol", "protocol": "HTTP Protocol", "ui": "UI", "ux": "UX", "sap": "SAP", "active": "Active Directory", "directory": "Active Directory", "jee": "Java EE", "jpa": "Spring Data JPA", "spark": "Spark", "ai": "Artificial Intelligence", "learning": "Machine Learning", "machine": "Machine Learning", "akka": "Akka", "graphql": "GraphQL", "jest": "Jest", "itil": "ITIL", "excel": "Excel", "security": "Security", "zend": "Zend", "gitlab": "GitLab", "photoshop": "Adobe Photoshop", "sketch": "Sketch", "uml": "UML", "boost": "Boost", "stl": "STL", "gradle": "Gradle", "mvvm": "MVVM", "xcode": "XCode", "cocoapods": "CocoaPods", "firebase": "Firebase", "vagrant": "Vagrant", "chef": "Chef", "apache": "Apache", "tsql": "T-SQL", "bi": "Business Intelligence", "phpunit": "PHPUnit", "client": "Working with client", "responsive": "Responsive Web Design", "hive": "Hive", "wordpress": "WordPress", "oop": "OOP", "cucumber": "Cucumber", "amazon": "AWS", "soapui": "SoapUI", "pm": "Project Management", "automated": "Automated Testing", "groovy": "Groovy", "spock": "Spock", "winforms": "WinForms", "webapi": "WebAPI", "wpf": "WPF", "cocoa": "Cocoa", "communication": "Communication skills", "quality": "Quality Assurance", "leadership": "Leadership", "unity": "Unity", "gcp": "GCP", "karma": "Karma", "jasmine": "Jasmine", "magento": "Magento", "grunt": "Grunt", "gulp": "Gulp", "soa": "SOA", "powershell": "PowerShell", "protocols": "Network Protocols", "bash": "Bash", "react.js": "React.js", "go": "GO Lang", "lang": "GO Lang", "bamboo": "Bamboo", "terraform": "Terraform", "cassandra": "Cassandra", "solr": "Solr", "junit": "JUnit", "jsf": "JSF", "fastlane": "Fastlane", "express.js": "Node.js Express", "mocha": "Mocha", "driven": "Test Driven Development", "cordova": "Cordova", "enzyme": "Enzyme", "golang": "GO Lang", "perl": "Perl", "npm": "NPM", "flask": "Flask", "algorithms": "Algorithms", "script": "JavaScript", "embedded": "Embedded", "ajax": "Ajax", "native": "React Native", "ip": "TCP/IP", "mesos": "Mesos", "virtualization": "Virtualization", "protractor": "Protractor", "jmeter": "JMeter", "rxjs": "RxJS", "relational": "Relational Databases", "tensorflow": "TensorFlow", "json": "JSON", "microservices": "Microservices", "xml": "XML", "postman": "PostMan", "r": "R", "celery": "Celery", "rspec": "RSpec", "bdd": "BDD", "node": "Node.js", "jboss": "Jboss", "confluence": "Confluence", "enterprise": "Enterprise Architect", "eclipse": "Eclipse", "seo": "SEO", "es+": "ECMAScript", "atlassian": "Atlassian", "kanban": "Kanban", "german": "German", "bitbucket": "Bitbucket", "project": "Project Management", "engine": "Unreal Engine", "unreal": "Unreal Engine", "jsp": "JSP", "open": "Open source projects", "source": "Open source projects", "orm": "ORM", "jvm": "JVM", "material": "Google Material Design", "ionic": "Ionic", "tfs": "TFS", "gwt": "Google Web Toolkit", "office": "Microsoft Office", "tcp": "TCP/IP", "alm": "HP ALM", "bpmn": "BPMN", "debugging": "Debugging", "blockchain": "Blockchain", "monitoring": "Monitoring Systems", "robot": "Robot", "nodejs": "Node.js", "sense": "Sense of humor", "intellij": "IntelliJ", "codebases": "Large Codebases", "performance": "Performance Testing", "mockito": "Mockito"}, "skill_to_result": {"Node.js": {"popularity": "high", "salary_impact": "medium", "skill": "Node.js"}, "Node.js Express": {"popularity": "medium", "salary_impact": "medium", "skill": "Node.js Express"}, "AWS": {"popularity": "high", "salary_impact": "high", "skill": "AWS"}, "React.js": {"popularity": "high", "salary_impact": "medium", "skill": "React.js"}, "Redux": {"popularity": "high", "salary_impact": "medium", "skill": "Redux"}, "DevOps": {"popularity": "medium", "salary_impact": "high", "skill": "DevOps"}, "Ansible": {"popularity": "high", "salary_impact": "high", "skill": "Ansible"}, "Git": {"popularity": "high", "salary_impact": "medium", "skill": "Git"}, "Objective-C": {"popularity": "medium", "salary_impact": "high", "skill": "Objective-C"}, "JavaScript": {"popularity": "high", "salary_impact": "medium", "skill": "JavaScript"}, "Angular": {"popularity": "high", "salary_impact": "medium", "skill": "Angular"}, "Docker/containers": {"popularity": "high", "salary_impact": "medium", "skill": "Docker/containers"}, "CI/CD": {"popularity": "high", "salary_impact": "medium", "skill": "CI/CD"}, "Jenkins": {"popularity": "high", "salary_impact": "medium", "skill": "Jenkins"}, "Scrum": {"popularity": "high", "salary_impact": "medium", "skill": "Scrum"}, "Java": {"popularity": "high", "salary_impact": "high", "skill": "Java"}, "Spring Boot": {"popularity": "medium", "salary_impact": "high", "skill": "Spring Boot"}, "Spring": {"popularity": "high", "salary_impact": "high", "skill": "Spring"}, "Kafka": {"popularity": "medium", "salary_impact": "high", "skill": "Kafka"}, "NoSQL": {"popularity": "high", "salary_impact": "high", "skill": "NoSQL"}, "Kubernetes": {"popularity": "high", "salary_impact": "medium", "skill": "Kubernetes"}, ".NET": {"popularity": "high", "salary_impact": "medium", "skill": ".NET"}, "ASP .NET": {"popularity": "high", "salary_impact": "medium", "skill": "ASP .NET"}, "CSS": {"popularity": "high", "salary_impact": "medium", "skill": "CSS"}, "HTML": {"popularity": "high", "salary_impact": "medium", "skill": "HTML"}, "Tomcat": {"popularity": "medium", "salary_impact": "medium", "skill": "Tomcat"}, "Agile": {"popularity": "high", "salary_impact": "medium", "skill": "Agile"}, "Unit Testing": {"popularity": "high", "salary_impact": "medium", "skill": "Unit Testing"}, "REST API": {"popularity": "high", "salary_impact": "medium", "skill": "REST API"}, "JIRA": {"popularity": "high", "salary_impact": "low", "skill": "JIRA"}, "Automated Testing": {"popularity": "high", "salary_impact": "medium", "skill": "Automated Testing"}, "Hadoop": {"popularity": "medium", "salary_impact": "high", "skill": "Hadoop"}, "Big Data": {"popularity": "medium", "salary_impact": "high", "skill": "Big Data"}, "ETL": {"popularity": "medium", "salary_impact": "medium", "skill": "ETL"}, "Linux": {"popularity": "high", "salary_impact": "low", "skill": "Linux"}, "Django": {"popularity": "high", "salary_impact": "medium", "skill": "Django"}, "Python": {"popularity": "high", "salary_impact": "medium", "skill": "Python"}, "Design Patterns": {"popularity": "medium", "salary_impact": "medium", "skill": "Design Patterns"}, "PHP": {"popularity": "high", "salary_impact": "low", "skill": "PHP"}, "Symfony": {"popularity": "high", "salary_impact": "low", "skill": "Symfony"}, "MySQL": {"popularity": "high", "salary_impact": "low", "skill": "MySQL"}, "Domain Driven Development": {"popularity": "medium", "salary_impact": "high", "skill": "Domain Driven Development"}, "Entity Framework": {"popularity": "medium", "salary_impact": "medium", "skill": "Entity Framework"}, "SQL": {"popularity": "high", "salary_impact": "medium", "skill": "SQL"}, "Sharepoint": {"popularity": "low", "salary_impact": "low", "skill": "Sharepoint"}, "Hibernate": {"popularity": "high", "salary_impact": "medium", "skill": "Hibernate"}, "PL/SQL": {"popularity": "medium", "salary_impact": "medium", "skill": "PL/SQL"}, "Ruby on Rails": {"popularity": "high", "salary_impact": "medium", "skill": "Ruby on Rails"}, "Android": {"popularity": "high", "salary_impact": "medium", "skill": "Android"}, "Android SDK": {"popularity": "medium", "salary_impact": "low", "skill": "Android SDK"}, "RxJava": {"popularity": "medium", "salary_impact": "medium", "skill": "RxJava"}, "Kotlin": {"popularity": "medium", "salary_impact": "medium", "skill": "Kotlin"}, "SOLID": {"popularity": "medium", "salary_impact": "medium", "skill": "SOLID"}, "Clean Code": {"popularity": "medium", "salary_impact": "medium", "skill": "Clean Code"}, "ECMAScript": {"popularity": "high", "salary_impact": "medium", "skill": "ECMAScript"}, "Test Driven Development": {"popularity": "high", "salary_impact": "medium", "skill": "Test Driven Development"}, "Scripting": {"popularity": "medium", "salary_impact": "medium", "skill": "Scripting"}, "Shell": {"popularity": "medium", "salary_impact": "high", "skill": "Shell"}, "Unix": {"popularity": "medium", "salary_impact": "low", "skill": "Unix"}, "RWD": {"popularity": "medium", "salary_impact": "low", "skill": "RWD"}, "Java EE": {"popularity": "medium", "salary_impact": "high", "skill": "Java EE"}, "RabbitMQ": {"popularity": "medium", "salary_impact": "medium", "skill": "RabbitMQ"}, "Vue": {"popularity": "high", "salary_impact": "medium", "skill": "Vue"}, "SOAP": {"popularity": "medium", "salary_impact": "high", "skill": "SOAP"}, "Maven": {"popularity": "medium", "salary_impact": "high", "skill": "Maven"}, "Bootstrap": {"popularity": "medium", "salary_impact": "medium", "skill": "Bootstrap"}, "Doctrine": {"popularity": "low", "salary_impact": "low", "skill": "Doctrine"}, "Redis": {"popularity": "medium", "salary_impact": "medium", "skill": "Redis"}, "Manual Testing": {"popularity": "medium", "salary_impact": "low", "skill": "Manual Testing"}, "Webpack": {"popularity": "high", "salary_impact": "medium", "skill": "Webpack"}, "PostgreSQL": {"popularity": "high", "salary_impact": "medium", "skill": "PostgreSQL"}, "Quality Assurance": {"popularity": "medium", "salary_impact": "low", "skill": "Quality Assurance"}, "Oracle DB": {"popularity": "high", "salary_impact": "medium", "skill": "Oracle DB"}, "SVN": {"popularity": "medium", "salary_impact": "medium", "skill": "SVN"}, "C++": {"popularity": "high", "salary_impact": "medium", "skill": "C++"}, "Laravel": {"popularity": "medium", "salary_impact": "low", "skill": "Laravel"}, "TypeScript": {"popularity": "high", "salary_impact": "medium", "skill": "TypeScript"}, "nginx": {"popularity": "medium", "salary_impact": "low", "skill": "nginx"}, "iOS": {"popularity": "medium", "salary_impact": "medium", "skill": "iOS"}, "MongoDB": {"popularity": "high", "salary_impact": "medium", "skill": "MongoDB"}, "Swift": {"popularity": "medium", "salary_impact": "high", "skill": "Swift"}, "ISTQB": {"popularity": "medium", "salary_impact": "low", "skill": "ISTQB"}, "Selenium": {"popularity": "high", "salary_impact": "medium", "skill": "Selenium"}, "Cloud": {"popularity": "high", "salary_impact": "high", "skill": "Cloud"}, "LESS": {"popularity": "medium", "salary_impact": "low", "skill": "LESS"}, "SASS": {"popularity": "medium", "salary_impact": "low", "skill": "SASS"}, "jQuery": {"popularity": "high", "salary_impact": "low", "skill": "jQuery"}, "Distributed systems": {"popularity": "medium", "salary_impact": "high", "skill": "Distributed systems"}, "Functional programming": {"popularity": "medium", "salary_impact": "medium", "skill": "Functional programming"}, "Scala": {"popularity": "high", "salary_impact": "high", "skill": "Scala"}, "MSSQL": {"popularity": "medium", "salary_impact": "low", "skill": "MSSQL"}, "WCF": {"popularity": "medium", "salary_impact": "high", "skill": "WCF"}, "Visual Studio": {"popularity": "medium", "salary_impact": "medium", "skill": "Visual Studio"}, "TeamCity": {"popularity": "medium", "salary_impact": "medium", "skill": "TeamCity"}, "Azure": {"popularity": "high", "salary_impact": "medium", "skill": "Azure"}, "SPA": {"popularity": "low", "salary_impact": "low", "skill": "SPA"}, "Elasticsearch": {"popularity": "high", "salary_impact": "low", "skill": "Elasticsearch"}, "CQRS": {"popularity": "medium", "salary_impact": "medium", "skill": "CQRS"}, "SCSS": {"popularity": "medium", "salary_impact": "low", "skill": "SCSS"}, "Puppet": {"popularity": "medium", "salary_impact": "high", "skill": "Puppet"}, "Webservices": {"popularity": "low", "salary_impact": "medium", "skill": "Webservices"}, "HTTP Protocol": {"popularity": "medium", "salary_impact": "low", "skill": "HTTP Protocol"}, "UI": {"popularity": "medium", "salary_impact": "medium", "skill": "UI"}, "UX": {"popularity": "medium", "salary_impact": "low", "skill": "UX"}, "SAP": {"popularity": "medium", "salary_impact": "high", "skill": "SAP"}, "Active Directory": {"popularity": "medium", "salary_impact": "low", "skill": "Active Directory"}, "Spring Data JPA": {"popularity": "medium", "salary_impact": "medium", "skill": "Spring Data JPA"}, "Spark": {"popularity": "medium", "salary_impact": "high", "skill": "Spark"}, "Artificial Intelligence": {"popularity": "low", "salary_impact": "medium", "skill": "Artificial Intelligence"}, "Machine Learning": {"popularity": "high", "salary_impact": "high", "skill": "Machine Learning"}, "Akka": {"popularity": "medium", "salary_impact": "medium", "skill": "Akka"}, "GraphQL": {"popularity": "low", "salary_impact": "medium", "skill": "GraphQL"}, "Jest": {"popularity": "medium", "salary_impact": "medium", "skill": "Jest"}, "ITIL": {"popularity": "medium", "salary_impact": "high", "skill": "ITIL"}, "Excel": {"popularity": "medium", "salary_impact": "low", "skill": "Excel"}, "Security": {"popularity": "medium", "salary_impact": "medium", "skill": "Security"}, "Zend": {"popularity": "medium", "salary_impact": "low", "skill": "Zend"}, "GitLab": {"popularity": "medium", "salary_impact": "medium", "skill": "GitLab"}, "Adobe Photoshop": {"popularity": "medium", "salary_impact": "low", "skill": "Adobe Photoshop"}, "Sketch": {"popularity": "medium", "salary_impact": "low", "skill": "Sketch"}, "UML": {"popularity": "medium", "salary_impact": "medium", "skill": "UML"}, "Boost": {"popularity": "low", "salary_impact": "medium", "skill": "Boost"}, "STL": {"popularity": "medium", "salary_impact": "medium", "skill": "STL"}, "Gradle": {"popularity": "medium", "salary_impact": "medium", "skill": "Gradle"}, "MVVM": {"popularity": "low", "salary_impact": "medium", "skill": "MVVM"}, "XCode": {"popularity": "medium", "salary_impact": "medium", "skill": "XCode"}, "CocoaPods": {"popularity": "low", "salary_impact": "medium", "skill": "CocoaPods"}, "Firebase": {"popularity": "low", "salary_impact": "medium", "skill": "Firebase"}, "Vagrant": {"popularity": "low", "salary_impact": "high", "skill": "Vagrant"}, "Chef": {"popularity": "medium", "salary_impact": "high", "skill": "Chef"}, "Apache": {"popularity": "medium", "salary_impact": "medium", "skill": "Apache"}, "T-SQL": {"popularity": "medium", "salary_impact": "medium", "skill": "T-SQL"}, "Business Intelligence": {"popularity": "low", "salary_impact": "high", "skill": "Business Intelligence"}, "PHPUnit": {"popularity": "medium", "salary_impact": "low", "skill": "PHPUnit"}, "Working with client": {"popularity": "low", "salary_impact": "low", "skill": "Working with client"}, "Responsive Web Design": {"popularity": "low", "salary_impact": "low", "skill": "Responsive Web Design"}, "Hive": {"popularity": "low", "salary_impact": "high", "skill": "Hive"}, "WordPress": {"popularity": "medium", "salary_impact": "low", "skill": "WordPress"}, "OOP": {"popularity": "high", "salary_impact": "medium", "skill": "OOP"}, "Cucumber": {"popularity": "medium", "salary_impact": "high", "skill": "Cucumber"}, "SoapUI": {"popularity": "medium", "salary_impact": "medium", "skill": "SoapUI"}, "Project Management": {"popularity": "medium", "salary_impact": "high", "skill": "Project Management"}, "Groovy": {"popularity": "medium", "salary_impact": "medium", "skill": "Groovy"}, "Spock": {"popularity": "medium", "salary_impact": "medium", "skill": "Spock"}, "WinForms": {"popularity": "low", "salary_impact": "medium", "skill": "WinForms"}, "WebAPI": {"popularity": "medium", "salary_impact": "medium", "skill": "WebAPI"}, "WPF": {"popularity": "medium", "salary_impact": "medium", "skill": "WPF"}, "Cocoa": {"popularity": "low", "salary_impact": "medium", "skill": "Cocoa"}, "Communication skills": {"popularity": "medium", "salary_impact": "medium", "skill": "Communication skills"}, "Leadership": {"popularity": "low", "salary_impact": "high", "skill": "Leadership"}, "Unity": {"popularity": "medium", "salary_impact": "low", "skill": "Unity"}, "GCP": {"popularity": "low", "salary_impact": "low", "skill": "GCP"}, "Karma": {"popularity": "low", "salary_impact": "low", "skill": "Karma"}, "Jasmine": {"popularity": "medium", "salary_impact": "low", "skill": "Jasmine"}, "Magento": {"popularity": "medium", "salary_impact": "low", "skill": "Magento"}, "Grunt": {"popularity": "medium", "salary_impact": "low", "skill": "Grunt"}, "Gulp": {"popularity": "medium", "salary_impact": "medium", "skill": "Gulp"}, "SOA": {"popularity": "medium", "salary_impact": "high", "skill": "SOA"}, "PowerShell": {"popularity": "medium", "salary_impact": "medium", "skill": "PowerShell"}, "Network Protocols": {"popularity": "low", "salary_impact": "medium", "skill": "Network Protocols"}, "Bash": {"popularity": "high", "salary_impact": "medium", "skill": "Bash"}, "GO Lang": {"popularity": "high", "salary_impact": "medium", "skill": "GO Lang"}, "Bamboo": {"popularity": "low", "salary_impact": "high", "skill": "Bamboo"}, "Terraform": {"popularity": "medium", "salary_impact": "high", "skill": "Terraform"}, "Cassandra": {"popularity": "medium", "salary_impact": "high", "skill": "Cassandra"}, "Solr": {"popularity": "low", "salary_impact": "low", "skill": "Solr"}, "JUnit": {"popularity": "medium", "salary_impact": "medium", "skill": "JUnit"}, "JSF": {"popularity": "low", "salary_impact": "high", "skill": "JSF"}, "Fastlane": {"popularity": "low", "salary_impact": "medium", "skill": "Fastlane"}, "Mocha": {"popularity": "low", "salary_impact": "low", "skill": "Mocha"}, "Cordova": {"popularity": "low", "salary_impact": "medium", "skill": "Cordova"}, "Enzyme": {"popularity": "low", "salary_impact": "medium", "skill": "Enzyme"}, "Perl": {"popularity": "medium", "salary_impact": "high", "skill": "Perl"}, "NPM": {"popularity": "low", "salary_impact": "high", "skill": "NPM"}, "Flask": {"popularity": "medium", "salary_impact": "medium", "skill": "Flask"}, "Algorithms": {"popularity": "medium", "salary_impact": "medium", "skill": "Algorithms"}, "Embedded": {"popularity": "medium", "salary_impact": "medium", "skill": "Embedded"}, "Ajax": {"popularity": "low", "salary_impact": "low", "skill": "Ajax"}, "React Native": {"popularity": "medium", "salary_impact": "medium", "skill": "React Native"}, "TCP/IP": {"popularity": "medium", "salary_impact": "medium", "skill": "TCP/IP"}, "Mesos": {"popularity": "low", "salary_impact": "high", "skill": "Mesos"}, "Virtualization": {"popularity": "low", "salary_impact": "low", "skill": "Virtualization"}, "Protractor": {"popularity": "medium", "salary_impact": "low", "skill": "Protractor"}, "JMeter": {"popularity": "medium", "salary_impact": "medium", "skill": "JMeter"}, "RxJS": {"popularity": "low", "salary_impact": "low", "skill": "RxJS"}, "Relational Databases": {"popularity": "medium", "salary_impact": "low", "skill": "Relational Databases"}, "TensorFlow": {"popularity": "low", "salary_impact": "high", "skill": "TensorFlow"}, "JSON": {"popularity": "medium", "salary_impact": "medium", "skill": "JSON"}, "Microservices": {"popularity": "medium", "salary_impact": "high", "skill": "Microservices"}, "XML": {"popularity": "medium", "salary_impact": "medium", "skill": "XML"}, "PostMan": {"popularity": "medium", "salary_impact": "low", "skill": "PostMan"}, "R": {"popularity": "low", "salary_impact": "high", "skill": "R"}, "Celery": {"popularity": "medium", "salary_impact": "medium", "skill": "Celery"}, "RSpec": {"popularity": "low", "salary_impact": "low", "skill": "RSpec"}, "BDD": {"popularity": "medium", "salary_impact": "medium", "skill": "BDD"}, "Jboss": {"popularity": "low", "salary_impact": "high", "skill": "Jboss"}, "Confluence": {"popularity": "medium", "salary_impact": "medium", "skill": "Confluence"}, "Enterprise Architect": {"popularity": "low", "salary_impact": "high", "skill": "Enterprise Architect"}, "Eclipse": {"popularity": "low", "salary_impact": "medium", "skill": "Eclipse"}, "SEO": {"popularity": "low", "salary_impact": "low", "skill": "SEO"}, "Atlassian": {"popularity": "low", "salary_impact": "low", "skill": "Atlassian"}, "Kanban": {"popularity": "medium", "salary_impact": "medium", "skill": "Kanban"}, "German": {"popularity": "medium", "salary_impact": "medium", "skill": "German"}, "Bitbucket": {"popularity": "low", "salary_impact": "medium", "skill": "Bitbucket"}, "Unreal Engine": {"popularity": "medium", "salary_impact": "low", "skill": "Unreal Engine"}, "JSP": {"popularity": "low", "salary_impact": "high", "skill": "JSP"}, "Open source projects": {"popularity": "medium", "salary_impact": "low", "skill": "Open source projects"}, "ORM": {"popularity": "low", "salary_impact": "medium", "skill": "ORM"}, "JVM": {"popularity": "medium", "salary_impact": "high", "skill": "JVM"}, "Google Material Design": {"popularity": "low", "salary_impact": "low", "skill": "Google Material Design"}, "Ionic": {"popularity": "low", "salary_impact": "high", "skill": "Ionic"}, "TFS": {"popularity": "low", "salary_impact": "high", "skill": "TFS"}, "Google Web Toolkit": {"popularity": "low", "salary_impact": "high", "skill": "Google Web Toolkit"}, "Microsoft Office": {"popularity": "low", "salary_impact": "low", "skill": "Microsoft Office"}, "HP ALM": {"popularity": "low", "salary_impact": "medium", "skill": "HP ALM"}, "BPMN": {"popularity": "low", "salary_impact": "low", "skill": "BPMN"}, "Debugging": {"popularity": "low", "salary_impact": "low", "skill": "Debugging"}, "Blockchain": {"popularity": "medium", "salary_impact": "high", "skill": "Blockchain"}, "Monitoring Systems": {"popularity": "low", "salary_impact": "high", "skill": "Monitoring Systems"}, "Robot": {"popularity": "low", "salary_impact": "medium", "skill": "Robot"}, "Sense of humor": {"popularity": "low", "salary_impact": "low", "skill": "Sense of humor"}, "IntelliJ": {"popularity": "low", "salary_impact": "high", "skill": "IntelliJ"}, "Large Codebases": {"popularity": "low", "salary_impact": "high", "skill": "Large Codebases"}, "Performance Testing": {"popularity": "low", "salary_impact": "medium", "skill": "Performance Testing"}, "Mockito": {"popularity": "low", "salary_impact": "high", "skill": "Mockito"}}}